from . import speak_case_bp
from flask import request, jsonify

# 大家都在搜
@speak_case_bp.route('/talkcase')
def get_talkcase():
    talk_list = [
        {
            "id": 100,
            "title": "话术开场",
            "childs": [
                '恋爱调情',
                '趣味搭讪',
                '话题重新开场',
                '勾起好奇',
                '表情话术',
                '搭讪开场'
            ]
        },
        {
            "id": 101,
            "title": "幽默互动",
            "childs": [
                '自恋类别',
                '调侃类别',
                '打情骂俏',
                '共谋与赞美',
                '名人名言配文',
                '幽默聊天'
            ]
        },
        {
            "id": 102,
            "title": "初聊互动",
            "childs": [
                '情感链接',
                '共鸣故事',
                '废物测试',
                '异议处理',
                '冷读术',
                '框架筛选',
                '联系感建立',
                '话块连情',
                '化解IOD',
                '高价值展示',
                '价值型聊天',
                '初聊互动',
                '设立框架'
            ]
        },
        {
            "id": 103,
            "title": "感情升温",
            "childs": [
                '恋爱调情',
                '情感波动',
                '关系升高',
                '框架与拉升',
                '框架推拉',
                '隐性诱惑',
                '合约恋人',
                '文字进挪',
                '表达兴趣',
                '暧昧套路',
                '真心话大冒险'
            ]
        },
        {
            "id": 104,
            "title": "邀约技巧",
            "childs": [
                '预期建立',
                '邀约话术',
                '速约模板',
                '模糊邀约',
                '促成邀约'
            ]
        },
        {
            "id": 105,
            "title": "见面约会",
            "childs": [
                '聊天模板',
                '颜色星座手相',
                '互动与游戏',
                '现场聊天',
                '约会套路',
                '进挪与升级'
            ]
        }
    ]
    return jsonify(talk_list)